Documents/ИА_ЗаказНаПриобретение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИА_ЗаказНаПриобретение</Name>
			<BasedOn>
				<xr:Item>Task.ИА_ЗадачаПланаДействий</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИА_ИсторияСтатусовЗВС</xr:Item>
				<xr:Item>AccumulationRegister.ИА_ЗаказыНаПриобретение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ситуация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_СостояниеЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВидДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаМесяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаНеделю</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаявкаНаОбязательства</v8:Type>
						<v8:Type>cfg:TaskRef.ИА_ЗадачаПланаДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияДочерняя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НФ_Заказ</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ИА_БПНоситель</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДССправочно</Name>
					<Comment>Используется только когда отключен раздельный учет нал/безнал. Ни на что не влияет. </Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВидДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСУ_СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВеб</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьТоваровУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ссылки</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Записан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗВС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Лента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Детали</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КСУ_КомментарииФП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_КомментарииФП</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_НФ_ЗаказНаПриобретение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_НФ_ЗаказНаПриобретение</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ИА_ЗаказыНаПриобретение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_ЗаказыНаПриобретение</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ИА_СредстваВРезервеНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваВРезервеНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ИА_ВидДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ВидДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИА_ЗаказНаПриобретение/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьКнопкиПроведения();
	
	Элементы.КомментарийСФП.Видимость= ЗначениеЗаполнено(КомментарийСФП);
	
	ПолучательКонтрагент = ТипЗнч(объект.Контрагент) = тип("СправочникСсылка.Контрагенты");
	ИзменениеПолучательКонтрагент();
	ВидимостьГолОрг();
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеПолучательКонтрагент(Перезаполнить = ложь)
	Элементы.ДекорацияПолучательКонтрагент.Заголовок = ?(ПолучательКонтрагент, "Из справочника ""Контрагенты""", "Свободный текст");
	Если Перезаполнить Тогда
		объект.Контрагент = ?(ПолучательКонтрагент, ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"), "" );
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьКнопкиПроведения()
	Элементы.ОтменаПроведения.Видимость = объект.Проведен и не Элементы.Статус.ТолькоПросмотр;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтатусыОдобрено = ИА_ФП.СтатусыОдобрено(истина);
	
	Номер = объект.Номер + ?(Объект.НомерВеб = "", "", "/"+ Объект.НомерВеб);
	ФП_по_ТБ = ИА_ФП_ПовторИсп.ФП_по_ТБ(объект.Дата);
	ИспПодразделения = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	
	ПоОрг = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	НФ_ЗП = Константы.ИА_ИспользоватьНФЗаказНаПриобретение.Получить();

	ИспользуютсяГруппыКомпаний = Справочники.ИА_ГруппыКомпаний.ПолучитьПризнакИспользованияГруппКомпаний();
	ОбязательноеУказаниеСрокаОплатыВЗВС = Константы.ИА_ФП_ОбязательноеУказаниеСрокаОплатыВЗВС.Получить();
	
	РазделятьНалБезнал = Константы.ИА_ФП_РазделятьНалИБезнал.Получить();
	ИспользоватьВидДССправочно = Константы.ИА_ФП_ИспользоватьВидДССправочно.Получить();
	
	// Картинки статусов
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_СостояниеЗаказа.Ссылка КАК Ссылка,
	               |	ИА_СостояниеЗаказа.Порядок КАК Порядок
	               |ИЗ
	               |	Перечисление.ИА_СостояниеЗаказа КАК ИА_СостояниеЗаказа";
	Выборка = запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() Цикл
		КартинкиСтатусов.Добавить(Выборка.ссылка,,,БиблиотекаКартинок["КСУ_статусЗаказа"+ строка(Выборка.Порядок+1)]); 
	КонецЦикла;
	
	//ФотоСтатусУтв = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.КСУ_СтатусУтверждена, УникальныйИдентификатор);
	//
	
	Параметры.Свойство("НеОповещать", НеОповещать);
	
	Если Параметры.Свойство("Основание") Тогда
		
		Основание = Параметры.Основание;
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ИА_ЗаявкаНаОбязательства") Тогда
			Объект.Основание = Основание;
			Если Параметры.Свойство("Сумма") Тогда
				Объект.Сумма = Параметры.Сумма;
			КонецЕсли;
			
			Объект.ОрганизацияДочерняя = Основание.Организация;
			Если ИспользуютсяГруппыКомпаний ТОгда
				Объект.Организация = ИА_ФП.ПолучитьГоловнуюОрганизацию(Объект.ОрганизацияДочерняя);
			КонецЕсли;
			
			Объект.Подразделение = Основание.Подразделение;
			Объект.Фонд = Основание.Фонд;
			Объект.Организация = Основание.Организация;
			
			Объект.ПредметЗаказа = Основание.ПредметЗаказа;
			Объект.Ситуация = Основание.Ситуация;
			Объект.Данные = Основание.Данные;
			Объект.Решение = Основание.Решение;
			
		КонецЕсли; 
	КонецЕсли;

	Элементы.ГруппаНФ.Видимость = ложь;
	
	Структура = ИА_ФП.ВернутьСтатусЗВС(Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Статус = Структура.Статус;
		ПричинаОтказа = Структура.ПричинаОтказа;
	Иначе	
		
		ПарамЗнач = Неопределено;
		
		Параметры.Свойство("ЗаказКопия", ПарамЗнач);
		Если ЗначениеЗаполнено(ПарамЗнач) тогда
			ЗаполнитьЗначенияСвойств(Объект, ПарамЗнач, "Ситуация, Данные, Решение, Организация, Фонд, Подразделение, ПредметЗаказа, ВидДС, ДатаОплаты, ОрганизацияДочерняя, ВидДССправочно, Статья, Контрагент"); 
		КонецЕсли;
		
		Статус = Перечисления.ИА_СостояниеЗаказа.Черновик;
		
		Объект.Сотрудник   = ПараметрыСеанса.ТекущийПользователь;
		Объект.Дата        = ТекущаяДата();
		Если ПоОрг и Объект.Организация.Пустая() ТОгда
			Объект.Организация = ИА_НастройкиС.ЗначениеНастройкиТекПользователя(ПланыВидовХарактеристик.ИА_НастройкиПользователей.ОсновнаяОрганизация);
			Объект.ОрганизацияДочерняя = Объект.Организация;
		КонецЕсли;
		
		Параметры.Свойство("Организация", ПарамЗнач);
		Если ЗначениеЗаполнено(ПарамЗнач) тогда
			Объект.Организация = ПарамЗнач;
			Объект.ОрганизацияДочерняя = ПарамЗнач;
		КонецЕсли;
		
		Параметры.Свойство("Фонд", ПарамЗнач);
		Если ЗначениеЗаполнено(ПарамЗнач) тогда
			Объект.Фонд = ПарамЗнач;
		КонецЕсли;
		
		Параметры.Свойство("Подразделение", ПарамЗнач);
		Если ЗначениеЗаполнено(ПарамЗнач) тогда
			Объект.Подразделение = ПарамЗнач;
		КонецЕсли;
		
		Параметры.Свойство("Статус", ПарамЗнач);
		Если ЗначениеЗаполнено(ПарамЗнач) тогда
			Статус = ПарамЗнач;
		КонецЕсли;
		
		Параметры.Свойство("Дата", ПарамЗнач);
		Если ЗначениеЗаполнено(ПарамЗнач) тогда
			Объект.Дата = ПарамЗнач;
		КонецЕсли;
		
		Параметры.Свойство("Сумма", ПарамЗнач);
		Если ЗначениеЗаполнено(ПарамЗнач) тогда
			Объект.Сумма = ПарамЗнач;
		КонецЕсли;
		
		Если ИспользуютсяГруппыКомпаний и не Объект.ОрганизацияДочерняя.Пустая() ТОгда
			Объект.Организация = ИА_ФП.ПолучитьГоловнуюОрганизацию(Объект.ОрганизацияДочерняя);
		КонецЕсли;
		
		Элементы.ГруппаФП.Доступность = ложь;
		
		Элементы.ОбщаяКомандаИА_СтруктураПодчиненностиФП.Видимость = ложь;
		Элементы.Декорация11.Видимость = ложь;
		Элементы.Группа2.Видимость = ложь;
		
	КонецЕсли;
	
	Элементы.ПричинаОтказа.Видимость = Статус = Перечисления.ИА_СостояниеЗаказа.Отклонен;
	
	Если Структура.РегистраторФП Тогда
		Элементы.ПричинаОтказа.ТолькоПросмотр   = Истина;
		Элементы.Дата.ТолькоПросмотр      		= Истина;
		Элементы.Группа11.ТолькоПросмотр      = Истина;
		Элементы.Группа12.ТолькоПросмотр      = Истина;
		Элементы.Группа13.ТолькоПросмотр      = Истина;
		Элементы.ПредметЗаказа.ТолькоПросмотр        = Истина;
		Элементы.Сотрудник.ТолькоПросмотр    	  = Истина;
		Элементы.ГруппаНФ.ТолькоПросмотр   		  = Истина;
		ЭтаФорма.КоманднаяПанель.ТолькоПросмотр   = Истина;
		Элементы.ГруппаОрганизацияДочерняя.ТолькоПросмотр = Истина;
		Элементы.ГруппаОрганизацияГоловная.ТолькоПросмотр = Истина;
		Элементы.Основание.ТолькоПросмотр 		  = Истина;
		Элементы.Сумма.ТолькоПросмотр 		  = Истина;
		
		Элементы.Контрагент.ТолькоПросмотр 		  = Истина;
		Элементы.ПолучательКонтрагент.Доступность = ложь;
		Элементы.ГруппаЗРС.ТолькоПросмотр 		  = Истина;
		Элементы.Добавить.Доступность 		  = Ложь;		
		Элементы.ДатаОплаты.ТолькоПросмотр 		  = Истина;
		
		//Элементы.Статус.ТолькоПросмотр			= НЕ ПравоФП_ОтменаОтклоненияЗаказа ИЛИ Статус <> Перечисления.ИА_СостояниеЗаказа.Отклонен;
		Элементы.Статус.ТолькоПросмотр = истина;	
	КонецЕсли;
	
		
	Если СтатусыОдобрено.найти(Статус)<>Неопределено ИЛИ Статус = Перечисления.ИА_СостояниеЗаказа.Отклонен Тогда 
		
		Элементы.Дата.ТолькоПросмотр      		  = Истина;
		Элементы.Группа11.ТолькоПросмотр      = Истина;
		Элементы.Группа12.ТолькоПросмотр      = Истина;
		Элементы.Группа13.ТолькоПросмотр      = Истина;
		Элементы.ПредметЗаказа.ТолькоПросмотр        = Истина;
		Элементы.Сотрудник.ТолькоПросмотр    	  = Истина;
		Элементы.ГруппаНФ.ТолькоПросмотр   		  = Истина;
		ЭтаФорма.КоманднаяПанель.ТолькоПросмотр   = Истина;
		Элементы.ГруппаОрганизацияДочерняя.ТолькоПросмотр = Истина;
		Элементы.ГруппаОрганизацияГоловная.ТолькоПросмотр = Истина;
		Элементы.Основание.ТолькоПросмотр 		  = Истина;
		Элементы.Сумма.ТолькоПросмотр 		  = Истина;
		
		Элементы.Контрагент.ТолькоПросмотр 		  = Истина;
		Элементы.ПолучательКонтрагент.Доступность = ложь;
		Элементы.ГруппаЗРС.ТолькоПросмотр 		  = Истина;
		Элементы.Добавить.Доступность 		  = Ложь;
		Элементы.ДатаОплаты.ТолькоПросмотр 		  = Истина;
		
		Элементы.Статус.ТолькоПросмотр = истина;	
		
		//Элементы.ГруппаНФ.Видимость = НФ_ЗП;
		Если СтатусыОдобрено.найти(Статус)<>Неопределено Тогда
            Если ИА_БФКС.РеквизитЕсть(Объект.НФ_Заказ, "Завершен") Тогда
                Если Объект.НФ_Заказ.Завершен Тогда
                    Элементы.НФ_Заказ.ЦветФона = Новый Цвет(255, 150,150);
                КонецЕсли;
            КонецЕсли; 
		Иначе
			Элементы.СоздатьЗаказНаПриобретение.Доступность = ложь;
		КонецЕсли;
		
		Элементы.КнопкаПровести.Видимость = Ложь;
		Элементы.КнопкаЗаписать.Видимость = Ложь;
		Элементы.Закрыть.Видимость = истина;
	КонецЕсли;
		
	Если РазделятьНалБезнал Тогда
		
		Элементы.ВидДС.Видимость = Истина;
		Элементы.ВидДССправочно.Видимость = ложь;
		
	Иначе	
		
		Элементы.ВидДС.Видимость = Ложь;
		Элементы.ВидДССправочно.Видимость = ИспользоватьВидДССправочно;
		Элементы.ДекорацияВидДС.Видимость = ИспользоватьВидДССправочно;
		
		Если Объект.ВидДС <> Перечисления.ИА_ВидДенежныхСредств.Безналичные Тогда 
			Объект.ВидДС = Перечисления.ИА_ВидДенежныхСредств.Безналичные;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Статья.Видимость = ФП_по_ТБ;
	
	Элементы.ГруппаОрганизацияДочерняя.Видимость = ПоОрг;
	
	Если ИспользуютсяГруппыКомпаний тогда
		Элементы.Декорация18.Заголовок = "Головная:";	
		Элементы.ГруппаОрганизацияГоловная.ТолькоПросмотр = истина;	
		Элементы.Организация.ОтображениеПодсказки=ОтображениеПодсказки.Нет;
	КонецЕсли;
	
	Элементы.ДатаОплаты.ОтметкаНезаполненного = ОбязательноеУказаниеСрокаОплатыВЗВС;
	
	/// доступность статусов	
	ПравоФП_УтверждениеЗаказовРуководителем  = ИА_ПраваС.ЗначениеПраваТекПользователя("ФП_УтверждениеЗаказовРуководителем") или ИА_ПраваС.ЗначениеПраваТекПользователя(ПланыВидовХарактеристик.ИА_ПраваПользователей.ФП_ПолныеПрава);
	ПравоФП_ОтправкаНаРассмотрениеЗаказаНаФП = ИА_ПраваС.ЗначениеПраваТекПользователя("ФП_ОтправкаНаРассмотрениеЗаказаНаФП") или ИА_ПраваС.ЗначениеПраваТекПользователя(ПланыВидовХарактеристик.ИА_ПраваПользователей.ФП_ПолныеПрава);
	//ПравоФП_ОтменаОтклоненияЗаказа			 = ИА_ПраваС.ЗначениеПраваТекПользователя("ФП_ОтменаОтклоненияЗаказа");
	
	Элементы.Статус.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Статус) тогда
		Элементы.Статус.СписокВыбора.Добавить(Статус);
	КонецЕсли;

	если Объект.Ссылка.Пустая() и Элементы.Статус.СписокВыбора.НайтиПоЗначению(Перечисления.ИА_СостояниеЗаказа.Черновик) = Неопределено Тогда
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.ИА_СостояниеЗаказа.Черновик);
	КонецЕсли;
	
	если Элементы.Статус.СписокВыбора.НайтиПоЗначению(Перечисления.ИА_СостояниеЗаказа.Подготовлен) = Неопределено Тогда
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.ИА_СостояниеЗаказа.Подготовлен);
	КонецЕсли;
		
	Если ПравоФП_УтверждениеЗаказовРуководителем Тогда
		если Элементы.Статус.СписокВыбора.НайтиПоЗначению(Перечисления.ИА_СостояниеЗаказа.УтвержденРуководителем) = Неопределено Тогда
			Элементы.Статус.СписокВыбора.Добавить(Перечисления.ИА_СостояниеЗаказа.УтвержденРуководителем);
		КонецЕсли;
		если Элементы.Статус.СписокВыбора.НайтиПоЗначению(Перечисления.ИА_СостояниеЗаказа.ОтклоненРуководителем) = Неопределено Тогда
			Элементы.Статус.СписокВыбора.Добавить(Перечисления.ИА_СостояниеЗаказа.ОтклоненРуководителем);
		КонецЕсли;
	КонецЕсли;
	
	Если ПравоФП_ОтправкаНаРассмотрениеЗаказаНаФП Тогда
		если Элементы.Статус.СписокВыбора.НайтиПоЗначению(Перечисления.ИА_СостояниеЗаказа.РассмотретьНаФП) = Неопределено Тогда
			Элементы.Статус.СписокВыбора.Добавить(Перечисления.ИА_СостояниеЗаказа.РассмотретьНаФП);
		КонецЕсли;
	КонецЕсли;
	
	//Если Статус = Перечисления.ИА_СостояниеЗаказа.Отклонен И ПравоФП_ОтменаОтклоненияЗаказа Тогда
	//	если Элементы.Статус.СписокВыбора.НайтиПоЗначению(Перечисления.ИА_СостояниеЗаказа.РассмотретьНаФП) = Неопределено Тогда
	//		Элементы.Статус.СписокВыбора.Добавить(Перечисления.ИА_СостояниеЗаказа.РассмотретьНаФП);
	//	КонецЕсли;
	//КонецЕсли;
	
	//если Элементы.Статус.СписокВыбора.НайтиПоЗначению(Перечисления.ИА_СостояниеЗаказа.Отклонен) = Неопределено Тогда
	//	Элементы.Статус.СписокВыбора.Добавить(Перечисления.ИА_СостояниеЗаказа.Отклонен);
	//КонецЕсли;
	
	Для каждого стрСтат из Элементы.Статус.СписокВыбора Цикл
		стрСтат.Картинка = КартинкиСтатусов.НайтиПоЗначению(стрСтат.Значение).Картинка;
	КонецЦикла;
	
	//Элементы.Подразделение.Видимость = ИспПодразделения;
	
	ОдобренияВыплаты.Параметры.УстановитьЗначениеПараметра("ЗП", объект.Ссылка);
	Лента.Параметры.УстановитьЗначениеПараметра("объект", объект.Ссылка);
	ОбновитьВылатыНаСервере();
	//	
	ВидимостьПлатежек = ОсталосьВыплатить > 0;
	ВидимостьЗакрытия = ОстатокЗаказа > 0 и Статус <> Перечисления.ИА_СостояниеЗаказа.Отклонен
										  и Статус <> Перечисления.ИА_СостояниеЗаказа.ОтклоненРуководителем
										  и Статус <> Перечисления.ИА_СостояниеЗаказа.Закрыт
										  и ПравоДоступа("Добавление", Метаданные.Документы.ИА_ЗакрытиеЗаказаНаПриобретение);
	Если ВидимостьЗакрытия = ложь и ВидимостьПлатежек = ложь тогда
		Элементы.ГруппаСоздатьНаОсновании.Видимость = ложь;
	ИначеЕсли ВидимостьЗакрытия и ВидимостьПлатежек = ложь тогда
		для каждого эл из Элементы.ГруппаСоздатьНаОсновании.ПодчиненныеЭлементы Цикл
			Если эл <> Элементы.ДокументИА_ЗакрытиеЗаказаНаПриобретениеСоздатьНаОсновании Тогда
				эл.Видимость = ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//
	Элементы.Декорация11.Видимость = ОсталосьВыплатить > 0;
	
	
	Если ЗначениеЗаполнено(объект.Ссылка) Тогда
		Запрос = новый запрос;
		запрос.Текст = "ВЫБРАТЬ
		               |	КСУ_КомментарииФПСрезПоследних.Комментарий КАК Комментарий
		               |ИЗ
		               |	РегистрСведений.КСУ_КомментарииФП.СрезПоследних(, Заказ = &Заказ) КАК КСУ_КомментарииФПСрезПоследних";
		Запрос.УстановитьПараметр("Заказ", объект.Ссылка);
		выборка = запрос.Выполнить().Выбрать();
		Если выборка.Следующий() Тогда
			КомментарийСФП = выборка.Комментарий;
		КонецЕсли;
	КонецЕсли;

	Элементы.ОткрытьИнструкцию.Видимость = Константы.КСУ_ПоказыватьИнструкциюВЗаказе.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтоимостьТекущейСтроки()
	ТекСтрока = Элементы.ПереченьТоваровУслуг.ТекущиеДанные;
	ТекСтрока.Стоимость = ТекСтрока.Количество*ТекСтрока.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровУслугКоличествоПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПересчитатьСтоимостьТекущейСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровУслугЦенаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПересчитатьСтоимостьТекущейСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровУслугСтоимостьПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ТекСтрока = Элементы.ПереченьТоваровУслуг.ТекущиеДанные;
	ТекСтрока.Цена = ТекСтрока.Стоимость / ?(ТекСтрока.Количество=0,1,ТекСтрока.Количество);
	
	Объект.Сумма = Объект.ПереченьТоваровУслуг.Итог("Стоимость");
КонецПроцедуры

Функция ИА_ЗаказНаПриобретениеСоздать()
	отч = Отчеты.ИА_ЗаказНаПриобретение.Создать();
	отч.СсылкаНаОбъект = Объект.Ссылка;
    тд = отч.Печать();
	Возврат тд;
КонецФункции


&НаКлиенте
Процедура КомандаПечать(Команда)
	// Вставить содержимое обработчика.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) или Модифицированность Тогда
		ПоказатьПредупреждение(,"Необходимо сначала записать документ!");
		Возврат;
	КонецЕсли;
	тд = ИА_ЗаказНаПриобретениеСоздать();
	тд.Показать("Заказ на приобретение "+объект.Номер);
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНаОснованииИнкассовоеПоручениеПолученное(Команда)
	
	П = Новый Структура;
	
	П.Вставить("Основание", Объект.Ссылка);
	
	ОткрытьФорму("Документ.ИнкассовоеПоручениеПолученное.ФормаОбъекта", П);
	
КонецПроцедуры


&НаКлиенте
Процедура ВвестиНаОснованииПлатежноеПоручениеИсходящее(Команда)
	П = Новый Структура;
	
	П.Вставить("Основание", Объект.Ссылка);
	
	ОткрытьФорму("Документ.ПлатежноеПоручениеИсходящее.ФормаОбъекта", П);
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНаОснованииПлатежноеТребованиеПолученное(Команда)
	П = Новый Структура;
	
	П.Вставить("Основание", Объект.Ссылка);
	
	ОткрытьФорму("Документ.ПлатежноеТребованиеПолученное.ФормаОбъекта", П);
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНаОснованииПлатежныйОрдерСписаниеДенежныхСредств(Команда)
	П = Новый Структура;
	
	П.Вставить("Основание", Объект.Ссылка);
	
	ОткрытьФорму("Документ.ПлатежныйОрдерСписаниеДенежныхСредств.ФормаОбъекта", П);
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНаОснованииРасходныйКассовыйОрдер(Команда)
	П = Новый Структура;
	
	П.Вставить("Основание", Объект.Ссылка);
	
	ОткрытьФорму("Документ.РасходныйКассовыйОрдер.ФормаОбъекта", П);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Структура = ИА_ФП.ВернутьСтатусЗВС(Объект.Ссылка);
	СтатусСсылка = Структура.Статус;
		
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Статус",Статус);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("СтатусСсылка",СтатусСсылка);
	Если Статус = Перечисления.ИА_СостояниеЗаказа.Отклонен Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ПричинаОтказа",ПричинаОтказа);
	КонецЕсли;
	
	// Лента
	Если объект.Ссылка.Пустая() Тогда
		Новстр = ТекущийОбъект.лента.Добавить();
		Новстр.Период = ТекущаяДата();
		Новстр.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Новстр.Событие = "Создан";
		Новстр.Детали = Статус;
	КонецЕсли;
	
	ПослСтатус = Перечисления.ИА_СостояниеЗаказа.ПустаяСсылка();
	Если ТекущийОбъект.Лента.Количество()>0 Тогда
		ПослСтатус = ТекущийОбъект.Лента[ТекущийОбъект.Лента.Количество()-1].Детали;
	КонецЕсли;
	
	Если (Статус <> ПослСтатус и Статус <> СтатусСсылка) или объект.Ссылка.Пустая() Тогда
		Новстр = ТекущийОбъект.лента.Добавить();
		Новстр.Период = ТекущаяДата();
		Новстр.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Новстр.Событие = строка(Статус);
		Новстр.Детали = Статус;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВвестиНаОснованииСписаниеСРасчетногоСчета(Команда)
	П = Новый Структура;
	
	П.Вставить("Основание", Объект.Ссылка);
	
	ОткрытьФорму("Документ.СписаниеСРасчетногоСчета.ФормаОбъекта", П);
КонецПроцедуры

&НаКлиенте
Процедура ФайлыТаблицаПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
	Диалог.Заголовок = "Выберите файл"; 
	Диалог.ПолноеИмяФайла = "";
	Диалог.Каталог = ПолучитьКаталогХраненияФайлов();
	Диалог.МножественныйВыбор = Ложь; 
	Если Диалог.Выбрать() Тогда 
		Элементы.ФайлыТаблица.ТекущиеДанные.ПутьКФайлу = Диалог.ВыбранныеФайлы;//Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКаталогХраненияФайлов()
	Возврат Константы.ИА_КаталогХраненияФайловФП.Получить();
КонецФункции

&НаКлиенте
Процедура ФайлыТаблицаПутьКФайлуОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Попытка
		ЗапуститьПриложение(Элементы.ФайлыТаблица.ТекущиеДанные.ПутьКФайлу,,Ложь);
	Исключение
		Сообщить("Сбой открытия файла!", СтатусСообщения.Информация);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	Если Объект.Номер = "" тогда
		Записать();
	КонецЕсли;
	
	Если Объект.Номер = "" тогда
		возврат;
	КонецЕсли;
	
	ПутьКФайлу = ПолучитьКаталогХраненияФайлов();

	Если ПутьКФайлу = "" Тогда
		Сообщить("В настройках не указан путь к хранению файлов!", СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
		
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ДобавитьФайлЗавершение1", ЭтотОбъект), ,, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлЗавершение1(Результат, Адрес, ВыбранноеИмя, ДополнительныеПараметры) Экспорт
	
	
	Если Результат Тогда
		
		ФайлНаДискеСуществует = Ложь;
		КаталогНаДиске = "";
		
		ПоместитьФайлОбъектаНачало(Объект.Номер, Адрес, ВыбранноеИмя, ФайлНаДискеСуществует, КаталогНаДиске);  //ФайлНаДискеСуществует, КаталогНаДиске будут возвращены
		
		ВыбранныйВариантДействия = Неопределено;
		Если ФайлСуществует(КаталогНаДиске, ВыбранноеИмя) Тогда
			
			ВариантыДействий = Новый СписокЗначений;
			ВариантыДействий.Добавить(2, "Заменить");
			ВариантыДействий.Добавить(1, "Сохранить оба файла");
			ВариантыДействий.Добавить(0, "Отменить загрузку");
			
			дп = новый Структура("АдресВременногоХранилища,КаталогНаДиске,ВыбранноеИмя",Адрес,КаталогНаДиске,ВыбранноеИмя);
			ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьФайлЗавершение", ЭтотОбъект,дп), "Файл "+ВыбранноеИмя+" уже существует!"+Символы.ПС+"Выберите действие которое надо совершить.", ВариантыДействий);     
			Возврат;
			
		КонецЕсли;
		
		ПоместитьФайлОбъектаОкончание(Адрес, КаталогНаДиске, ВыбранноеИмя, ВыбранныйВариантДействия);
		
		Модифицированность = истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВыбранныйВариантДействия = РезультатВопроса;
	ПоместитьФайлОбъектаОкончание(ДополнительныеПараметры.АдресВременногоХранилища, ДополнительныеПараметры.КаталогНаДиске, ДополнительныеПараметры.ВыбранноеИмя, ВыбранныйВариантДействия);
	Модифицированность = Истина;

КонецПроцедуры


//Веб
&НаКлиенте
Процедура НачатьПодключениеРасширенияРаботыСФайламиЗавершение(Подключено, ДополнительныеПараметры) Экспорт    
    Если Не Подключено Тогда
        Оповещение = Новый ОписаниеОповещения("НачатьУстановкуРасширенияРаботыСФайламиЗавершение", ЭтаФорма, ДополнительныеПараметры);
        ТекстСообщения = НСтр("ru='Для продолжении работы необходимо установить расширение для веб-клиента ""1С:Предприятие"". Установить?'");
        ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет); 
    Иначе
		ОткрытьФайлЗавершение(Неопределено);
    КонецЕсли;    
КонецПроцедуры

//Веб
&НаКлиенте
Процедура НачатьУстановкуРасширенияРаботыСФайламиЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        НачатьУстановкуРасширенияРаботыСФайлами();
    КонецЕсли;    
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	Если Элементы.ФайлыТаблица.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияРаботыСФайламиЗавершение", ЭтаФорма,);
		НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	#Иначе
		ОткрытьФайлЗавершение(Неопределено);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлЗавершение(ДополнительныеПараметры) Экспорт
	
	имяФайла = Элементы.ФайлыТаблица.ТекущиеДанные.Имя;
	НомерЗВС = Элементы.ФайлыТаблица.ТекущиеДанные.НомерЗВС;
	
	АдресВременногоХранилища = ПоместитьТекущийФайлВБуфер(имяФайла, НомерЗВС);
	Если ЗначениеЗаполнено(АдресВременногоХранилища) Тогда
		НачатьПолучениеКаталогаВременныхФайлов(новый ОписаниеОповещения("ОткрытьФайлЗавершение1",ЭтотОбъект,новый Структура("имяФайла,АдресВременногоХранилища",имяФайла, АдресВременногоХранилища)));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлЗавершение1(КатВр, ДополнительныеПараметры) Экспорт
	
	врИмяФайла = КатВр + ДополнительныеПараметры.имяФайла;
	#Если ВебКлиент Тогда
		ПолучитьФайл(ДополнительныеПараметры.АдресВременногоХранилища,врИмяФайла, истина);
	#Иначе
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДополнительныеПараметры.АдресВременногоХранилища);
		ДвоичныеДанные.Записать(врИмяФайла);
		ЗапуститьПриложение(врИмяФайла);
	#КонецЕсли

КонецПроцедуры


&НаКлиенте
Процедура ФайлыТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	ОткрытьФайл(Неопределено);	
КонецПроцедуры

//&НаКлиенте
//Процедура ОткрытиеФайла()
//	
//	Если Элементы.ФайлыТаблица.ТекущиеДанные = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	имяФайла = Элементы.ФайлыТаблица.ТекущиеДанные.Имя;
//	НомерЗВС = Элементы.ФайлыТаблица.ТекущиеДанные.НомерЗВС;
//	
//	АдресВременногоХранилища = ПоместитьТекущийФайлВБуфер(имяФайла,НомерЗВС);
//	Если ЗначениеЗаполнено(АдресВременногоХранилища) Тогда
//		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
//		врИмяФайла = КаталогВременныхФайлов() + имяФайла;
//		ДвоичныеДанные.Записать(врИмяФайла);
//		ЗапуститьПриложение(врИмяФайла);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СохранитьФайл(Команда)
//	
//	Если Элементы.ФайлыТаблица.ТекущиеДанные = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Режим = РежимДиалогаВыбораФайла.Сохранение;
//	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
//	ДиалогОткрытияФайла.ПолноеИмяФайла = Элементы.ФайлыТаблица.ТекущиеДанные.Имя;
//	ДиалогОткрытияФайла.Заголовок = "Сохранение файла";
//	Расширение = Сред(Элементы.ФайлыТаблица.ТекущиеДанные.Имя,Найти(Элементы.ФайлыТаблица.ТекущиеДанные.Имя, ".")+1);
//    Фильтр = "(*."+ Расширение +")|*."+Расширение+"";
//    ДиалогОткрытияФайла.Фильтр = Фильтр;
//    ДиалогОткрытияФайла.Расширение = Расширение;
//	Если ДиалогОткрытияФайла.Выбрать() Тогда
//		АдресВременногоХранилища = ПоместитьТекущийФайлВБуфер(Элементы.ФайлыТаблица.ТекущиеДанные.Имя,Элементы.ФайлыТаблица.ТекущиеДанные.НомерЗВС);
//		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
//		ДвоичныеДанные.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла);
//	КонецЕсли;
//	
//	
//КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(Команда)	
	Если Элементы.ФайлыТаблица.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	#Если ВебКлиент Тогда
	    Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияРаботыСФайламиЗавершение", ЭтаФорма);
	    НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	#Иначе
		СохранитьФайлЗавершение(Неопределено);
	#КонецЕсли
	
			
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлЗавершение(ДополнительныеПараметры) Экспорт
	
    Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Элементы.ФайлыТаблица.ТекущиеДанные.Имя;
	ДиалогОткрытияФайла.Заголовок = "Сохранение файла";
	Расширение = Сред(Элементы.ФайлыТаблица.ТекущиеДанные.Имя,Найти(Элементы.ФайлыТаблица.ТекущиеДанные.Имя, ".")+1);
	Фильтр = "(*."+ Расширение +")|*."+Расширение+"";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Расширение = Расширение;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		ВыбранныйКаталог = Новый Файл(ДиалогОткрытияФайла.Каталог);
		
		АдресВременногоХранилища = ПоместитьТекущийФайлВБуфер(Элементы.ФайлыТаблица.ТекущиеДанные.Имя, Элементы.ФайлыТаблица.ТекущиеДанные.НомерЗВС);
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		
		Попытка
			ДвоичныеДанные.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьПолноеИмяФайла(ВыбранноеИмя,НомерЗВС="")
	
	КаталогХранения = ПолучитьКаталогХраненияФайлов();
	Если НомерЗВС = "" тогда 
		КаталогХранения = КаталогХранения + СОКРЛП(Объект.Номер) + "\";
	Иначе
		КаталогХранения = КаталогХранения + СОКРЛП(НомерЗВС) + "\";
	КонецЕсли;
	
	КаталогХранения = КаталогХранения + ВыбранноеИмя;

	Возврат КаталогХранения;
	
КонецФункции

&НаСервере
Процедура УстановитьНомер()
    Если НЕ ЗначениеЗаполнено(Объект.Номер) Тогда
        об = РеквизитФормыВЗначение("Объект");
        об.УстановитьНовыйНомер();
        ЗначениеВРеквизитФормы(об, "Объект");
    КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПоместитьТекущийФайлВБуфер(ВыбранноеИмя,НомерЗВС="")
	
	КаталогХранения	= ПолучитьПолноеИмяФайла(ВыбранноеИмя,НомерЗВС); 
	ФайлДляПередачи = Новый ДвоичныеДанные(КаталогХранения);
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ФайлДляПередачи, УникальныйИдентификатор);
	
	Возврат АдресВременногоХранилища;
	
КонецФункции


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

КонецПроцедуры


&НаКлиенте
Процедура ФондПриИзменении(Элемент)
	
	Если Объект.Подразделение.Пустая() Тогда
		Отбор = Новый Структура("Организация, Фонд, Дата",
		                      Объект.Организация, Объект.Фонд, Объект.Дата);  
		                      
		 Объект.Подразделение = ИА_ФП.ПолучитьПодразделениеПоФонду(Отбор);
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ТекОбъект = РеквизитФормыВзначение("Объект");
	Для каждого Строка Из ТекОбъект.Файлы Цикл
		Если Строка.Записан = Ложь Тогда
			Строка.Записан = Истина;
		КонецЕсли;
	КонецЦикла;
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");	
	
	Лента.Параметры.УстановитьЗначениеПараметра("объект", ТекущийОбъект.Ссылка);
	Элементы.Лента.Обновить();
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии()
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаСервере
Функция НайтиФайлНаСервере(ФайлИмя)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Имя", ФайлИмя);
	Если Объект.Ссылка.Файлы.НайтиСтроки(ПараметрыОтбора).Количество() = 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

&НаСервере
Процедура ПриЗакрытииНаСервере()
	КаталогХранения = ПолучитьКаталогХраненияФайлов();
	Если СОКРЛП(Объект.Номер) = "" или СтрДлина(КаталогХранения) < 2 Тогда
		возврат;
	КонецЕсли;
	//Необходимо проверять записанную версию
	КаталогХранения = КаталогХранения + СОКРЛП(Объект.Номер) + "\";
	МассивНайденныхФайлов = НайтиФайлы(КаталогХранения,"*.*",Истина);
	Для Каждого ФайлНаДиске Из МассивНайденныхФайлов Цикл
        //Сообщить(ФайлНаДиске.Имя);
		Если ФайлНаДиске.Расширение = "" Тогда
			Продолжить;
		Иначе
			ФайлУдалить = НайтиФайлНаСервере(ФайлНаДиске.имя);
			Если ФайлУдалить Тогда
				ФайлДляУдаления = КаталогХранения + ФайлНаДиске.имя;
				УдалитьФайлы(ФайлДляУдаления);
			КонецЕсли;
		КонецЕсли;	
    КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	//ЗаполнитьСписокВыбораФондов();	 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораФондов()

	Отбор = Новый Структура();
	
	Отбор.Вставить("НаДату",        Объект.Дата);
	Отбор.Вставить("Организация",   Объект.Организация);
	Отбор.Вставить("Подразделение", Объект.Подразделение);
	 	
	Результат = иа_фп.ЗаполнитьСписокФондамиПоПодразделениям(Отбор);
	
	Если НЕ Результат = Неопределено Тогда
		
	   Элементы.Фонд.СписокВыбора.Очистить();

		Для каждого ТекЭлемент Из Результат Цикл
		  Элементы.Фонд.СписокВыбора.Добавить(ТекЭлемент);
		КонецЦикла; 
	
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСписокВыбораФондов()


&НаКлиенте
Процедура Зарплата1ПриИзменении(Элемент)
	обновитьСуммуДокПоЗП();
КонецПроцедуры

&НаСервере
Процедура обновитьСуммуДокПоЗП()
	Объект.Сумма = Объект.Зарплата.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура Зарплата1ПослеУдаления(Элемент)
	обновитьСуммуДокПоЗП();
КонецПроцедуры

&НаКлиенте
Процедура ЗаМесяцПриИзменении(Элемент)
	Объект.ЗаМесяц = НачалоМесяца(объект.ЗаМесяц);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПоместитьФайлОбъектаНачало(Номер, АдресВременногоХранилища, ВыбранноеИмя, ФайлНаДискеСуществует = Ложь, КаталогХранения = "")
	
	Если Найти(ВыбранноеИмя,"\")>0 или Найти(ВыбранноеИмя,"/")>0 Тогда
		Сч = СтрДлина(ВыбранноеИмя);
		Поз = 0;
		Пока Сч > 0 Цикл
			Симв = Сред(ВыбранноеИмя, Сч, 1);
			если Симв = "\" или Симв = "/" Тогда
				Поз = Сч;
				Прервать;
			КонецЕсли;
			Сч = Сч - 1;
		КонецЦикла;
		
		ВыбранноеИмя = Сред(ВыбранноеИмя, сч + 1);
	КонецЕсли;
	
	КаталогХранения = ПолучитьКаталогХраненияФайлов();
	
	КаталогХранения = КаталогХранения + СОКРЛП(Номер) + "\"; КаталогФайлов = КаталогХранения;
	
	КаталогНаДиске = Новый Файл(КаталогХранения);
	
	Если НЕ КаталогНаДиске.Существует() Тогда
		СоздатьКаталог(КаталогХранения);
	КонецЕсли;
	
	ФайлНаДискеСуществует = ФайлСуществует(КаталогХранения, ВыбранноеИмя);
	
КонецПроцедуры
	
&НаСервере
Процедура ПоместитьФайлОбъектаОкончание(АдресВременногоХранилища, КаталогФайлов, ВыбранноеИмя, ВыбранныйВариантДействия = 0)
	
	Если ВыбранныйВариантДействия = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	МодифицироватьФайлПоВыбранномуДействию(КаталогФайлов, ВыбранноеИмя, ВыбранныйВариантДействия); 
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	КаталогХранения = КаталогФайлов + ВыбранноеИмя;
	ДвоичныеДанные.Записать(КаталогХранения);
	
	МассивСтрок = Объект.Файлы.НайтиСтроки(Новый Структура("Имя", ВыбранноеИмя));
	
	Если МассивСтрок.Количество()=0 Тогда
		НоваяСтрока = Объект.Файлы.Добавить();
	иначе 
		НоваяСтрока = МассивСтрок[0];
	КонецЕсли;
	
	НоваяСтрока.Имя = ВыбранноеИмя;
	НоваяСтрока.Дата = ТекущаяДата();
	НоваяСтрока.Ответственный = ТекЮзер();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекЮзер()
		
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ФайлСуществует(ИмяКаталога, ИмяФайла)
	
	КаталогНаДиске =  Новый Файл(ИмяКаталога+ИмяФайла);
	
	ФайлСуществует = КаталогНаДиске.Существует();
	
	КаталогНаДиске =Неопределено;
	
	Возврат ФайлСуществует;
	
КонецФункции

&НаСервере
Процедура МодифицироватьФайлПоВыбранномуДействию(ИмяКаталога, ИмяФайла, ВыбранныйВариантДействия = 0) 
	
	КаталогНаДиске =  Новый Файл(ИмяКаталога+ИмяФайла);
 
	ИмяФайлаБезРасширения = КаталогНаДиске.ИмяБезРасширения; 
	Расширение = КаталогНаДиске.Расширение;
	НовоеИмяФайла = ИмяФайла;
	Сч =0;
	
	Если ВыбранныйВариантДействия = 2 Тогда //Замещаем файл на диске
		
	ИначеЕсли ВыбранныйВариантДействия = 1 Тогда // Добавляем к имени файла _<сч>
		
		Пока КаталогНаДиске.Существует() Цикл
			
			Сч = Сч + 1; 
			НовоеИмяФайла = ИмяФайлаБезРасширения + "_" + Сч + Расширение;
			КаталогНаДиске = Новый Файл(ИмяКаталога + НовоеИмяФайла);
			
			//навсякий случай прерывание.
			Если Сч = 1000000000 тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Слишком много файлов в каталоге! Выберите другой каталог!"; 
				Сообщение.Сообщить();
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;	
		
	Иначе    //отмена добавления файла
		Возврат;
	КонецЕсли;
	
	ИмяФайла = НовоеИмяФайла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияУпрПриИзменении(Элемент)
	
	ГоловнаяОрганизация = ИА_ФП.ПолучитьГоловнуюОрганизацию(Объект.ОрганизацияДочерняя);
	Объект.Организация = ГоловнаяОрганизация;
	ВидимостьГолОрг();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(,Элемент.ТекущиеДанные.Ссылки);
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьИнструкцию(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ОткрытьФорму("ОбщаяФорма.ИА_ФП_БазаЗнанийПЗП", ПараметрыФормы);

КонецПроцедуры
//Конец Арчил Тваладзе 17.05.2016

&НаКлиенте
Процедура СоздатьЗаказНаПриобретение(Команда)
    Если ЗначениеЗаполнено(Объект.НФ_Заказ) Тогда
		возврат;
	КонецЕсли;
	
	списокМаршрутов = ПолучитьСписокМаршрутовНФ();
	ВыбМаршрут = Неопределено;
	Если списокМаршрутов.количество() = 0 Тогда
		возврат;
	ИначеЕсли списокМаршрутов.количество() = 1 Тогда
		ВыбМаршрут = списокМаршрутов[0];
	Иначе
		спис = Новый СписокЗначений;
		спис.ЗагрузитьЗначения(списокМаршрутов);
		рез = Неопределено;

		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("СоздатьЗаказНаПриобретениеЗавершение", ЭтотОбъект), спис,Элементы.СоздатьЗаказНаПриобретение);
        Возврат;
	КонецЕсли;
	
	СоздатьЗаказНаПриобретениеФрагмент(ВыбМаршрут);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказНаПриобретениеЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	рез = ВыбранныйЭлемент;
	Если рез = Неопределено Тогда
		возврат;
	КонецЕсли;
	ВыбМаршрут = рез.Значение;
	
	СоздатьЗаказНаПриобретениеФрагмент(ВыбМаршрут);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказНаПриобретениеФрагмент(Знач ВыбМаршрут)
	
	Перем рез_НФ;
	
	рез_НФ = СоздатьБП_Заказ(ВыбМаршрут, объект.Ссылка);
	Если рез_НФ <> Неопределено Тогда
		Объект.НФ_Заказ = рез_НФ;
		Записать();
		ПоказатьПредупреждение(,"Заказ на приобретение запущен!");
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьБП_Заказ(маршрут, заявка)
	//ЗапросРекв = Новый Запрос;
	//ЗапросРекв.Текст = "ВЫБРАТЬ
	//                   |	ИА_БПРеквизиты.Ссылка КАК Реквизит,
	//                   |	&Заявка КАК Значение
	//                   |ИЗ
	//                   |	ПланВидовХарактеристик.ИА_БПРеквизиты КАК ИА_БПРеквизиты
	//                   |ГДЕ
	//                   |	ИА_БПРеквизиты.ВладелецРеквизита = &ВладелецРеквизита
	//                   |	И ИА_БПРеквизиты.Наименование = ""Заявка""
	//                   |	И ИА_БПРеквизиты.ПометкаУдаления = ЛОЖЬ";
	//ЗапросРекв.УстановитьПараметр("ВладелецРеквизита", маршрут);
	//ЗапросРекв.УстановитьПараметр("Заявка", Заявка);
	//тз_ДопРекв = ЗапросРекв.Выполнить().Выгрузить();
	//Если тз_ДопРекв.Количество()=0 Тогда
	//	Сообщить("У маршрута НФ нет реквизита ""Заявка""!");
	//	возврат Неопределено;
	//КонецЕсли;
	
	Попытка
		бп = БизнесПроцессы.ИА_БПНоситель.СоздатьБП(истина, маршрут,,заявка,ПараметрыСеанса.ТекущийПользователь,,);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	возврат бп;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокМаршрутовНФ()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_НФ_ЗаказНаПриобретение.Маршрут
	               |ИЗ
	               |	РегистрСведений.ИА_НФ_ЗаказНаПриобретение КАК ИА_НФ_ЗаказНаПриобретение";
	рез = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Маршрут");
	Возврат рез;
КонецФункции

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииСервер()
	Элементы.ПричинаОтказа.Видимость = Статус = Перечисления.ИА_СостояниеЗаказа.Отклонен;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьВидимостьКнопкиПроведения();
	Если не НеОповещать Тогда
		Оповестить("ЗаписьЗВС", Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьВылатыНаСервере()
	
	Если объект.Ссылка.Пустая() Тогда
		Элементы.ГруппаФинПоказатели.Видимость = ложь;
		возврат;
	КонецЕсли;
	
	ТабДокВыплат.Очистить();
	Об = РеквизитФормыВЗначение("Объект");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Обороты.СуммаБезналПриход), 0) КАК Одобрено,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА Обороты.Регистратор ССЫЛКА Документ.ИА_ЗакрытиеЗаказаНаПриобретение
		|					ТОГДА 0
		|				ИНАЧЕ Обороты.СуммаБезналРасход
		|			КОНЕЦ), 0) КАК Выплачено,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА Обороты.Регистратор ССЫЛКА Документ.ИА_ЗакрытиеЗаказаНаПриобретение
		|					ТОГДА Обороты.СуммаБезналРасход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК Закрыто,
		|	МАКСИМУМ(ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток, 0)) КАК ОсталосьВыплатить,
		|	МАКСИМУМ(ЕСТЬNULL(ЗаказыОстатки.СуммаОстаток, 0)) КАК ОстатокЗаказа
		|ИЗ
		|	Документ.ИА_ЗаказНаПриобретение КАК Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_ЗаказыНаПриобретение.Остатки(, ЗП = &ЗП) КАК ЗаказыОстатки
		|		ПО Заказы.Ссылка = ЗаказыОстатки.ЗП
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(, , Регистратор, ЗП = &ЗП) КАК Обороты
		|		ПО (Обороты.ЗП = Заказы.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(, ЗП = &ЗП) КАК ИА_СредстваВРезервеНаФондахОстатки
		|		ПО Заказы.Ссылка = ИА_СредстваВРезервеНаФондахОстатки.ЗП
		|ГДЕ
		|	Заказы.Ссылка = &ЗП";

	Запрос.УстановитьПараметр("ЗП",Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если выборка.Следующий() Тогда
		Одобрено = выборка.Одобрено;		
		Выплачено = выборка.Выплачено;
		Закрыто = выборка.Закрыто;
		ОсталосьВыплатить = выборка.ОсталосьВыплатить;
		ОстатокЗаказа = выборка.ОстатокЗаказа;
	КонецЕсли;
	
	Элементы.ДекорацияСуммаЗаказа.Заголовок = ИА_ФПСервер.ПолучитьФСЧисла(Объект.Сумма);
	Элементы.ДекорацияОдобрено.Заголовок = ИА_ФПСервер.ПолучитьФСЧисла(Одобрено);
	Элементы.ДекорацияВыплачено.Заголовок = ИА_ФПСервер.ПолучитьФСЧисла(Выплачено);
	Элементы.ДекорацияЗакрыто.Заголовок = ИА_ФПСервер.ПолучитьФСЧисла(Закрыто);
	Элементы.ДекорацияОсталосьВыплатить.Заголовок = ИА_ФПСервер.ПолучитьФСЧисла(ОсталосьВыплатить);
	
	Элементы.ГруппаЗакрыто.Видимость =  Закрыто<>0;
	Элементы.ГруппаОсталосьВыплатить.Видимость =  ОсталосьВыплатить<>0;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьГолОрг()
	Элементы.ГруппаОрганизацияГоловная.Видимость = ПоОрг и (Объект.Организация <> Объект.ОрганизацияДочерняя);
КонецПроцедуры
	
&НаКлиенте
Процедура ГруппаЗаклПриСменеСтраницы(Элемент, ТекущаяСтраница)
	//Если ТекущаяСтраница.Имя = "ГруппаФП" Тогда 
	//	ОбновитьВылатыНаСервере();
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабДокВыплатВыбор(Элемент, Область, СтандартнаяОбработка)
	Если Область.СодержитЗначение Тогда 
		ПоказатьЗначение(,Область.Значение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСрокОплатыСсылки(пСсылка)
	возврат пСсылка.ДатаОплаты;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ДатаОплаты<>ПолучитьСрокОплатыСсылки(объект.Ссылка) и Объект.ДатаОплаты<НачалоДня(ТекущаяДата()) Тогда
		Отказ = Истина;
		Сообщить("Укажите корректный срок оплаты!");
		возврат;
	КонецЕсли;
	
	Если Статус = ПредопределенноеЗначение("Перечисление.ИА_СостояниеЗаказа.РассмотретьНаФП") и объект.Организация.Пустая() и ПоОрг Тогда
		Отказ = Истина;
		Сообщить("Укажите организацию!");
		возврат;
	КонецЕсли;
	
	//Если ФП_по_ТБ и Объект.Статья.Пустая() Тогда
	//	Отказ = Истина;
	//	Сообщить("Укажите статью!");
	//	возврат;
	//КонецЕсли;
	//
	//Если ИспПодразделения и Объект.Подразделение.Пустая() Тогда
	//	Отказ = Истина;
	//	Сообщить("Укажите подразделение!");
	//	возврат;
	//КонецЕсли;
	//
КонецПроцедуры


&НаСервере
Процедура СтатьяПриИзмененииНаСервере()
	Объект.Фонд = Объект.Статья.Владелец;
КонецПроцедуры


&НаКлиенте
Процедура СтатьяПриИзменении(Элемент)
	Если Объект.Фонд.Пустая() ТОгда
		СтатьяПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СтатьяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УстановитьОграничениеСтатьи();
КонецПроцедуры

&НаСервере
Процедура УстановитьОграничениеСтатьи()
	НовыйМассив = Новый Массив();
	Если не объект.Фонд.Пустая() Тогда
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Фонд");		
		НовыйМассив.Добавить(НоваяСвязь);		
	КонецЕсли;
	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);		
	Элементы.Статья.СвязиПараметровВыбора = НовыеСвязи;
КонецПроцедуры


&НаКлиенте
Процедура ВидДССправочноНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	Список = Новый СписокЗначений;
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ИА_ВидДенежныхСредств.Наличные"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ИА_ВидДенежныхСредств.Безналичные"));
	
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеВыбораДС", ЭтотОбъект);
	ПоказатьВыборИзСписка(Оп, Список, Элементы.ВидДССправочно);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораДС(ВыбранныйЭлемент, парам) Экспорт
	Если ВыбранныйЭлемент<>Неопределено Тогда
		Объект.ВидДССправочно = ВыбранныйЭлемент.Значение;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОдобренияВыплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	тд = Элементы.ОдобренияВыплаты.ТекущиеДанные;
	ПоказатьЗначение(, тд.Регистратор);
КонецПроцедуры


&НаКлиенте
Процедура ПолучательКонтрагентПриИзменении(Элемент)
	ИзменениеПолучательКонтрагент(истина);
КонецПроцедуры
